In [1]:
ndarray

NameError: name 'ndarray' is not defined

In [2]:
import numpy as np
import pandas as pd

In [3]:
np.array([4,5,6,7])

array([4, 5, 6, 7])

In [4]:
np.arange(1,11).reshape(2,5)

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [5]:
np.arange(1,9).reshape(2,2,2)

array([[[1, 2],
        [3, 4]],

       [[5, 6],
        [7, 8]]])

In [6]:
# series
# dataframe

In [7]:
df = pd.read_csv("Data/sample.csv")

In [8]:
df

          name sex   age  height  weight
0       Aubrey   M  41.0      74     170
1          Ron   M  42.0      68     166
2         Carl   M  32.0      70     155
3      Antonio   M  39.0      72     167
4      Deborah   F  30.0      66     124
5   Jacqueline   F  33.0      66     115
6        Helen   F  26.0      64     121
7        David   M  30.0      71     158
8        James   M  53.0      72     175
9      Michael   M  32.0      69     143
10        Ruth   F  47.0      69     139
11        Joel   M  34.0      72     163
12       Donna   F  23.0      62      98
13       Roger   M  36.0      75     160
14         Yao   M   NaN      70     145
15   Elizabeth   F  31.0      67     135
16         Tim   M  29.0      71     176
17       Susan   F  28.0      65     131

In [9]:
df.head(5)
df.tail(5)
df.sample(8)

         name sex   age  height  weight
8       James   M  53.0      72     175
15  Elizabeth   F  31.0      67     135
0      Aubrey   M  41.0      74     170
14        Yao   M   NaN      70     145
17      Susan   F  28.0      65     131
6       Helen   F  26.0      64     121
3     Antonio   M  39.0      72     167
2        Carl   M  32.0      70     155

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    18 non-null     object
 1   sex     18 non-null     object
 2   age     17 non-null     float64
 3   height  18 non-null     int64
 4   weight  18 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 852.0+ bytes

In [11]:
df.describe()

             age     height      weight
count  17.000000  18.000000   18.000000
mean   34.470588  69.055556  146.722222
std     7.763035   3.522570   22.540958
min    23.000000  62.000000   98.000000
25%    30.000000  66.250000  132.000000
50%    32.000000  69.500000  150.000000
75%    39.000000  71.750000  165.250000
max    53.000000  75.000000  176.000000

In [12]:
# iloc
# loc

In [13]:
df.loc[5,'name']

'Jacqueline'

In [14]:
df.loc[[5,7],['name','age']]

         name   age
5  Jacqueline  33.0
7       David  30.0

In [15]:
df.loc[5:7,'name':'height']

         name sex   age  height
5  Jacqueline   F  33.0      66
6       Helen   F  26.0      64
7       David   M  30.0      71

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
type(df.iloc[2:7,0])

pandas.core.series.Series

In [18]:
df.iloc[:,2]

0     41.0
1     42.0
2     32.0
3     39.0
4     30.0
5     33.0
6     26.0
7     30.0
8     53.0
9     32.0
10    47.0
11    34.0
12    23.0
13    36.0
14     NaN
15    31.0
16    29.0
17    28.0
Name: age, dtype: float64

In [19]:
df[['name','age']]

          name   age
0       Aubrey  41.0
1          Ron  42.0
2         Carl  32.0
3      Antonio  39.0
4      Deborah  30.0
5   Jacqueline  33.0
6        Helen  26.0
7        David  30.0
8        James  53.0
9      Michael  32.0
10        Ruth  47.0
11        Joel  34.0
12       Donna  23.0
13       Roger  36.0
14         Yao   NaN
15   Elizabeth  31.0
16         Tim  29.0
17       Susan  28.0

In [20]:
df[df['age'] > 35]

       name sex   age  height  weight
0    Aubrey   M  41.0      74     170
1       Ron   M  42.0      68     166
3   Antonio   M  39.0      72     167
8     James   M  53.0      72     175
10     Ruth   F  47.0      69     139
13    Roger   M  36.0      75     160

In [21]:
df[df['sex'] == 'M']

       name sex   age  height  weight
0    Aubrey   M  41.0      74     170
1       Ron   M  42.0      68     166
2      Carl   M  32.0      70     155
3   Antonio   M  39.0      72     167
7     David   M  30.0      71     158
8     James   M  53.0      72     175
9   Michael   M  32.0      69     143
11     Joel   M  34.0      72     163
13    Roger   M  36.0      75     160
14      Yao   M   NaN      70     145
16      Tim   M  29.0      71     176

In [22]:
df[(df['sex'] == 'M') & (df['weight'] >= 170)]

      name sex   age  height  weight
0   Aubrey   M  41.0      74     170
8    James   M  53.0      72     175
16     Tim   M  29.0      71     176

In [23]:
ipl = pd.read_csv('Data/ipl-matches.csv')

In [24]:
# pd.set_option("display.max_rows",None)

In [25]:
result = ipl[ipl['MatchNumber'] == 'Final'][['Season','WinningTeam']].set_index("Season")
result

                   WinningTeam
Season
2022            Gujarat Titans
2021       Chennai Super Kings
2020/21         Mumbai Indians
2019            Mumbai Indians
2018       Chennai Super Kings
2017            Mumbai Indians
2016       Sunrisers Hyderabad
2015            Mumbai Indians
2014     Kolkata Knight Riders
2013            Mumbai Indians
2012     Kolkata Knight Riders
2011       Chennai Super Kings
2009/10    Chennai Super Kings
2009           Deccan Chargers
2007/08       Rajasthan Royals

In [26]:
result.value_counts()

WinningTeam
Mumbai Indians           5
Chennai Super Kings      4
Kolkata Knight Riders    2
Deccan Chargers          1
Gujarat Titans           1
Rajasthan Royals         1
Sunrisers Hyderabad      1
dtype: int64

In [27]:
# 
ipl['City'].unique()

array(['Ahmedabad', 'Kolkata', 'Mumbai', 'Navi Mumbai', 'Pune', 'Dubai',
       'Sharjah', 'Abu Dhabi', 'Delhi', 'Chennai', nan, 'Hyderabad',
       'Visakhapatnam', 'Chandigarh', 'Bengaluru', 'Jaipur', 'Indore',
       'Bangalore', 'Kanpur', 'Rajkot', 'Raipur', 'Ranchi', 'Cuttack',
       'Dharamsala', 'Kochi', 'Nagpur', 'Johannesburg', 'Centurion',
       'Durban', 'Bloemfontein', 'Port Elizabeth', 'Kimberley',
       'East London', 'Cape Town'], dtype=object)

In [28]:
# how many matches csk has won in cheenai
c1 = ipl['City'] == 'Chennai'
c2  = ipl['WinningTeam'] == 'Chennai Super Kings'
ipl[c1 & c2].shape[0]

40

In [29]:
ipl['WinningTeam'].unique()

array(['Gujarat Titans', 'Rajasthan Royals',
       'Royal Challengers Bangalore', 'Punjab Kings', 'Mumbai Indians',
       'Lucknow Super Giants', 'Sunrisers Hyderabad', 'Delhi Capitals',
       'Kolkata Knight Riders', 'Chennai Super Kings', 'Kings XI Punjab',
       nan, 'Delhi Daredevils', 'Rising Pune Supergiant', 'Gujarat Lions',
       'Rising Pune Supergiants', 'Pune Warriors', 'Deccan Chargers',
       'Kochi Tuskers Kerala'], dtype=object)

In [30]:
movies = pd.read_csv("Data/movies.csv")

In [31]:
l = [ 'Drama', 'War']

In [32]:
a = lambda x : "Action" in x

In [33]:
a(l)

False

In [34]:
movies[movies['genres'].str.split("|").apply(lambda x: "Action" in x)]

,title_x,imdb_id,poster_path,wiki_link,title_y,original_title,is_adult,year_of_release,runtime,genres,imdb_rating,imdb_votes,story,summary,tagline,actors,wins_nominations,release_date
0,Uri: The Surgical Strike,tt8291224,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Uri:_The_Surgica...,Uri: The Surgical Strike,Uri: The Surgical Strike,0,2019,138,Action|Drama|War,8.4,35112,Divided over five chapters the film chronicle...,Indian army special forces execute a covert op...,NaN,Vicky Kaushal|Paresh Rawal|Mohit Raina|Yami Ga...,4 wins,11 January 2019 (USA)
8,Manikarnika: The Queen of Jhansi,tt6903440,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Manikarnika:_The...,Manikarnika: The Queen of Jhansi,Manikarnika: The Queen of Jhansi,0,2019,148,Action|Biography|Drama,6.5,7361,Manikarnika born in Varanasi when Dixt a minis...,Story of Rani Lakshmibai one of the leading f...,NaN,Kangana Ranaut|Rimi Sen|Atul Kulkarni|Nalneesh...,NaN,25 January 2019 (USA)
13,Total Dhamaal,tt7639372,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Total_Dhamaal,Total Dhamaal,Total Dhamaal,0,2019,130,Action|Adventure|Comedy,4.3,4817,Total Dhamaal is the third instalment in the D...,A group of people learn about a hidden treasur...,The Wildest Adventure Ever,Ajay Devgn|Madhuri Dixit|Anil Kapoor|Riteish D...,NaN,22 February 2019 (India)
14,Sonchiriya,tt8108200,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Sonchiriya,Sonchiriya,Sonchiriya,0,2019,143,Action|Crime|Drama,7.5,2322,This is the story of a group of rebels in Cham...,Set in the Chambal valley the film follows th...,NaN,Sushant Singh Rajput|Bhumi Pednekar|Manoj Bajp...,NaN,1 March 2019 (India)
16,Mard Ko Dard Nahi Hota,tt8055888,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Mard_Ko_Dard_Nah...,Mard Ko Dard Nahin Hota,Mard Ko Dard Nahin Hota,0,2018,134,Action|Comedy,7.4,3969,It is a story of a young boy Surya who has a r...,It is a story of a young boy Surya who has a r...,NaN,Abhimanyu Dasani|Radhika Madan|Prateek Parmar|...,2 wins & 2 nominations,22 March 2019 (USA)
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1606,Hadh: Life on the Edge of Death,tt0396044,NaN,https://en.wikipedia.org/wiki/Hadh:_Life_on_th...,Hadh: Life on the Edge of Death,Hadh: Life on the Edge of Death,0,2001,\N,Action|Crime|Drama,4.5,11,Abandoned by his biological mother nicknamed ...,Abandoned by his biological mother nicknamed ...,NaN,Somesh Agarwal|Shama Deshpande|Vikram Gokhale|...,NaN,NaN
1607,Nayak (2001 Hindi film),tt0291376,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Nayak_(2001_Hind...,Nayak: The Real Hero,Nayak: The Real Hero,0,2001,187,Action|Drama|Thriller,7.8,12522,Employed as a camera-man at a popular televisi...,A man accepts a challenge by the chief ministe...,Fight the power,Anil Kapoor|Rani Mukerji|Amrish Puri|Johnny Le...,2 nominations,7 September 2001 (India)
1608,One 2 Ka 4,tt0227194,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/One_2_Ka_4,One 2 Ka 4,One 2 Ka 4,0,2001,169,Action|Comedy|Crime,5.4,4484,Javed Abbas (Jackie Shroff) is a widowed polic...,When a cop's partner is killed in the line of ...,NaN,Shah Rukh Khan|Juhi Chawla|Jackie Shroff|Nirma...,NaN,30 March 2001 (India)
1617,Officer (2001 film),tt0265452,NaN,https://en.wikipedia.org/wiki/Officer_(2001_film),Officer,Officer,0,2001,\N,Action|Crime|Drama,5.3,97,SPU unit officer Sagar Chauhan is assigned wit...,SPU unit officer Sagar Chauhan is assigned wit...,NaN,Sunil Shetty|Raveena Tandon|Danny Denzongpa|,NaN,14 March 2001 (Kuwait)
1627,Daaka,tt10833860,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Daaka,Daaka,Daaka,0,2019,136,Action,7.4,38,Shinda tries robbing a bank so he can be wealt...,Shinda tries robbing a bank so he can be wealt...,NaN,Gippy Grewal|Zareen Khan|,NaN,1 November 2019 (USA)

In [35]:
# filter all the action movies with rating more than 7.5
c1 = movies['genres'].str.contains("Action")
c2 = movies['imdb_rating'] > 7.5
movies[c1 & c2]['title_x']

0            Uri: The Surgical Strike
41               Family of Thakurganj
84                          Mukkabaaz
106                             Raazi
110     Parmanu: The Story of Pokhran
112           Bhavesh Joshi Superhero
169                  The Ghazi Attack
219                  Raag Desh (film)
258                     Irudhi Suttru
280                         Laal Rang
297                       Udta Punjab
354                     Dangal (film)
362                 Bajrangi Bhaijaan
365            Baby (2015 Hindi film)
393        Detective Byomkesh Bakshy!
449                 Titli (2014 film)
536                     Haider (film)
589                      Vishwaroopam
625                       Madras Cafe
668           Paan Singh Tomar (film)
693                Gangs of Wasseypur
694       Gangs of Wasseypur  Part 2
982                      Jodhaa Akbar
1039                 1971 (2007 film)
1058         Black Friday (2007 film)
1188               Omkara (2006 film)
1293               Sarkar (2005 film)
1294                            Sehar
1361                   Lakshya (film)
1432                        Gangaajal
1495                   Company (film)
1554       The Legend of Bhagat Singh
1607          Nayak (2001 Hindi film)
Name: title_x, dtype: object

In [36]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David',None],
    'Age': [25, None, 30, 22,None],
    'Score': [85, 92, None, 78,None],
    'Gender': ['Female', 'Male', None, 'Male',None]
}
temp = pd.DataFrame(data)
temp

      Name   Age  Score  Gender
0    Alice  25.0   85.0  Female
1      Bob   NaN   92.0    Male
2  Charlie  30.0    NaN    None
3    David  22.0   78.0    Male
4     None   NaN    NaN    None

In [37]:
temp.dropna()

    Name   Age  Score  Gender
0  Alice  25.0   85.0  Female
3  David  22.0   78.0    Male

In [38]:
temp.dropna(subset=['Age'])

      Name   Age  Score  Gender
0    Alice  25.0   85.0  Female
2  Charlie  30.0    NaN    None
3    David  22.0   78.0    Male

In [39]:
temp.dropna(axis =1,how = 'all')

      Name   Age  Score  Gender
0    Alice  25.0   85.0  Female
1      Bob   NaN   92.0    Male
2  Charlie  30.0    NaN    None
3    David  22.0   78.0    Male
4     None   NaN    NaN    None

In [40]:
temp.isnull().sum()

Name      1
Age       2
Score     2
Gender    2
dtype: int64

In [41]:
temp.dropna(how='all')

      Name   Age  Score  Gender
0    Alice  25.0   85.0  Female
1      Bob   NaN   92.0    Male
2  Charlie  30.0    NaN    None
3    David  22.0   78.0    Male

In [42]:
df = pd.read_excel('Data/fighter_details.xlsx')

In [45]:
df.rename(columns={'Division Title' : 'Division',
                   'Division Body_Wins': 'Wins',
                   'Division Body_Losses':'Loses',
                   'Division Body_Draws':'Draws',
                   'Bio Data_Hometown' : 'Hometown'},inplace=True)

In [46]:
df

,Name,Nickname,Division,Wins,Loses,Draws,Bio Data_Status,Hometown,Bio Data_Age,Bio Data_Height,...,Last Fight_Date,Fighter Facts,UFC History,Last Fight,Bio Data_Fighting style,Bio Data_Trains at,Records_Wins by Decision,Records_Fight Win Streak,Records_Former Champion,Records_Title Defenses
0,Francisco Prado,Null,Lightweight Division,11,1,0,Active,"San Lorenzo , Argentina",20,70.0,...,"Feb. 11, 2023","['Pro since 2019', 'Five wins by KO, six by su...",['UFC 284 (2/11/23) Prado lost a three round u...,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Jos Henrique,Null,Welterweight Division,0,1,0,Not Fighting,"Manaus, Brazil",20,NaN,...,NaN,[],[],No information is available for the last fight.,NaN,NaN,NaN,NaN,NaN,NaN
2,Rei Tsuruya,Null,Null,Null,Null,Null,Active,Japan,20,NaN,...,NaN,[],[],No information is available for the last fight.,NaN,NaN,NaN,NaN,NaN,NaN
3,Takeru Uchida,Null,Flyweight Division,1,0,0,Active,NaN,20,NaN,...,NaN,[],[],No information is available for the last fight.,NaN,NaN,NaN,NaN,NaN,NaN
4,Yamato Nishikawa,Null,Lightweight Division,0,0,0,Not Fighting,Japan,20,NaN,...,NaN,[],[],No information is available for the last fight.,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2559,Patrick Smith,Null,Heavyweight Division,4,2,0,Not Fighting,"Denver, United States",59,74.0,...,"Jul. 14, 1995",[],[],NaN,NaN,NaN,NaN,NaN,NaN,NaN
2560,Paul Jones,Null,Middleweight Division,0,0,0,Not Fighting,United States,59,0.0,...,"Sep. 24, 1999",[],[],NaN,NaN,NaN,NaN,NaN,NaN,NaN
2561,Randy Couture,The Natural,Light Heavyweight Division,19,11,0,Retired,United States,59,74.0,...,"Apr. 30, 2011",[],[],NaN,NaN,NaN,NaN,NaN,NaN,NaN
2562,Marco Ruas,Null,Heavyweight Division,0,0,0,Not Fighting,Brazil,60,0.0,...,"Jul. 16, 1999",[],[],NaN,NaN,NaN,NaN,NaN,NaN,NaN
2563,Tony Halme,Null,Heavyweight Division,0,0,0,Not Fighting,"Helsinki, Finland",60,0.0,...,"May. 30, 1997",[],[],NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [51]:
# replacing values
df['Wins'].replace({"Null": pd.NA},inplace=True)

In [52]:
df['Wins']

0         11
1          0
2       <NA>
3          1
4          0
        ...
2559       4
2560       0
2561      19
2562       0
2563       0
Name: Wins, Length: 2564, dtype: object

In [47]:
# changing a columns data type

In [55]:
df['Wins'] = pd.to_numeric(df['Wins'],errors="coerce")

In [60]:
df.sort_values("Wins",ascending=False)[0:10]

,Name,Nickname,Division,Wins,Loses,Draws,Bio Data_Status,Hometown,Bio Data_Age,Bio Data_Height,...,Last Fight_Date,Fighter Facts,UFC History,Last Fight,Bio Data_Fighting style,Bio Data_Trains at,Records_Wins by Decision,Records_Fight Win Streak,Records_Former Champion,Records_Title Defenses
2369,Jeremy Horn,Null,Middleweight Division,88.0,19,5,Not Fighting,"Omaha, United States",47,74.0,...,"Jan. 17, 2009",[],[],NaN,NaN,NaN,NaN,NaN,NaN,NaN
2459,Shonie Carter,Mr. International,Welterweight Division,66.0,14,7,Not Fighting,United States,50,69.0,...,NaN,[],[],No information is available for the last fight.,NaN,NaN,NaN,NaN,NaN,NaN
2246,Aleksei Oleinik,The Boa Constrictor,Heavyweight Division,60.0,17,1,Not Fighting,"Moscow, Russia",45,74.0,...,NaN,"['Pro since 1997', '47 wins by submission, eig...",['UFC Fight Night (10/1/22)Oleinik lost a thre...,No information is available for the last fight.,Jiu-Jitsu,School of MMA of Alexey Oleynik,NaN,NaN,NaN,NaN
2039,Brian Ebersole,Bad Boy,Welterweight Division,51.0,17,1,Not Fighting,United States,42,72.0,...,NaN,[],[],No information is available for the last fight.,NaN,NaN,NaN,NaN,NaN,NaN
2033,Alistair Overeem,The Demolition Man,Heavyweight Division,47.0,19,0,Not Fighting,"Hounslow, United Kingdom",42,76.0,...,NaN,[],[],No information is available for the last fight.,MMA,Joel Diaz Boxing,5.0,NaN,NaN,NaN
2432,Matt Hughes,Null,Welterweight Division,46.0,9,0,Retired,"Hillsboro, United States",49,69.0,...,"Sep. 24, 2011",[],[],NaN,NaN,NaN,NaN,NaN,NaN,NaN
2277,Joe Doerksen,El Dirte,Middleweight Division,45.0,14,0,Not Fighting,"New Bothwell, Canada",45,72.0,...,"Dec. 11, 2010",[],[],NaN,NaN,NaN,NaN,NaN,NaN,NaN
2526,Guy Mezger,Null,Middleweight Division,44.0,13,6,Retired,"Dallas, United States",55,73.0,...,"Mar. 5, 1999",[],[],NaN,NaN,NaN,NaN,NaN,NaN,NaN
2347,Yves Edwards,Null,Lightweight Division,42.0,22,1,Retired,Bahamas,46,69.0,...,NaN,[],[],No information is available for the last fight.,NaN,NaN,NaN,NaN,NaN,NaN
1522,Gegard Mousasi,Null,Middleweight Division,42.0,6,2,Not Fighting,"Teheran, Iran",37,74.0,...,"Apr. 8, 2017",[],[],NaN,NaN,NaN,NaN,NaN,NaN,NaN